alert("Հարգելի օգտվող ուզում ենք զգուշացնել, որ միանալու է երաժշտություն։ Եթե ձեզ դա կանհանգստացնի կարող եք իջացնել համակարգչի ձայնը");
var audio = new Audio('horse.mp3');
function test1(){
	var answer = prompt("Ո՞ր ճանապարհով գնամ, որ հասնեմ նվերին(1,2,3,4,5,6)");
	if(answer=="5"){
		alert("Այո, Ճիշտ է:) \n Կարող ես անցնել հաջորդ խնդրին");
	}
	else{
		alert("Ոչ, Սխալ է :( \n կրկին փորձիր");
	}
}
function test2(){
	var answer = prompt("Քանի՞ խաղալիք կարող ենք կախել ծառից(0,1,2,3,4)");
	if(answer=="5"){
		alert("Այո, Ճիշտ է:) \n Կարող ես անցնել հաջորդ խնդրին");
	}
	else{
		alert("Ոչ, Սխալ է :( \n կրկին փորձիր");
	}
}
function back_audio(){
	audio.play();
	setTimeout(back_audio, 20000);
}
back_audio();
function tale4(){
	var heavy = prompt("Գրեք մի ծանր բան");
	var hate = prompt("Մի մարդ, որին տանել չեք կարողանում");
	var blah = prompt("Գրեք մի զզվելի բան");
	var wheater = prompt("Գրեք մի եղանակ");
	var paint = prompt("Ձեզ հաճելի թե տհաճ է ներկի հոտը");
	var food = prompt("Գրեք մի ուտելիք, որը շատ եք սիրում");
	var item = prompt("Մի իր, որ միշտ ցանկացել եք ունենալ");
	var tale = "Այսօր դեկտեմբերի 31-ն է: Բոլորը ամանորյա տրամադրություն ունեն: Այդ օրը շատ տարօրինակ էր, որովհետև ձյան տեղը ";
	tale += heavy;
	tale += " էր գալիս: Բոլորը դուրս էին եկել նայելու այդ տարօրինակ ձյունը: Երբ ես դուրս եկա, այդ ";
	tale += heavy;
	tale += "ը ընկավ իմ գլխին, ես ուշաթափվեցի: Այդ ժամանակ ես տեսա ";
	tale += hate;
	tale += "ին, որը ինձ համար ";
	tale += blah;
	tale += " էր բերել: Հետո նա ինձ տարավ ";
	tale += wheater;
	tale += " պապի մոտ, և ես ստացա նրանից շատ ";
	tale += paint;
	tale += " նվերներ: Հետո ես գնացի ";
	tale += food;
	tale += " սենյակ . այնտեղ ամեն ինչը պատրաստված էր ";
	tale += food;
	tale += "ից: Ես ";
	tale += food;
	tale += "ամարդ պատրաստեցի և հոգնածությունից քնեցի: Արթնացա արդեն իմ անկողնում: Արդեն Ամանոր էր, և ես ստացա մի ուրիշ նվեր ";
	tale += wheater;
	tale += " պապից: Նա ինձ ";
	tale += item;
	tale += " էր տվել: \n \n Հեղինակ՝ Նազելի Տեր-Պետրասյան";
	alert(tale);
}
function tale3(){
	var fly = prompt("Մի վայր, որտեղ ճանճերը հավաքվում են։");
	var farmanimal = prompt("Ձեր սիրած գյուղական կենդանին։");
	var homelot = prompt("Ինչից է ձեր տանը շատ։");
	var egg = prompt("Ինչով եք պատրաստում ձվածեղ։");
	var market = prompt("Ինչ կվերցնեիք խանութից եթե ամեն ինչ անվճար լիներ։ (մեկ բան)");
	var santa = prompt("Ինչ է ձեզ հիշացնում ձմեռ պապիկ արտահայտությունը");
	var tale = "Մենք մեր ընտանիքով երկար մտածելուց հետո որոշեցինք Նոր տարին նշել ";
	tale += fly;
	tale += "։Այդ երեկոյան շատ ցուրտ էր և դրսում թափվում էր ";
	tale += farmanimal;
	tale += ", այդ տեսարանը շատ գեղեցիկ էր։ Ես ձմեռ պապիկից ուզել էի ";
	tale += homelot;
	tale += ", դա իմ կյանքի ամենամեծ երազանքն էր։ Այս տարի ես իմ ընտանիքի անդամների համար գնեցի ";
	tale += egg;
	tale += ",և նրանք շատ ուրախացան։ Արդեն մի քանի ժամ էր մնացել Նոր տարուն, առաքիչը ուշանում էր, ու մեր պատվիրած ";
	tale += market;
	tale += "ը չկար, որպեսզի մենք դնեինք մեր ամանորյա սեղանին։ Երբ խփեց ժամը տասներկուսը, առաքիչը ներս մտավ Ձյունանուշի հագուստով և ձեռքին մի հսկայական ";
	tale += market;
	tale += "։ Ծիծաղելին այն էր, որ Ձյունանուշը "
	tale += santa;
	tale += " էր։ Եվ մենք այս Նոր տարին դիմավորեցինք այդ "
	tale += santa;
	tale += " Ձյունանուշի հետ։ \n \n Հեղինակներ՝ Մարինե Ասատրյան և Անի Գևորգյան";
	alert(tale);
}
function tale2(){
	var home = prompt("Գրեք մի վայր, որտեղ ձեր տնային աշխատանքները արել եք(...ում)");
	var plate = prompt("Գրեք մի իր, որը միշտ երազել եք ունենալ");
	var place = prompt("Գրեք մի շինություն, որը ունի ամենաքիչը երեք հարկ");
	var singer = prompt("Գրեք ձեր սիրելի ուսուցչի անունը");
	var food = prompt("Ինչ հիմա կուտեիք");
	var sound = prompt("Ցատկել, գոռալ թե ճչալ եք նախնտրում ջղայնացած ժամանակ");
	var work = prompt("Որ մասնագիտությունը չեք սիրում");
	var black = prompt("Ինչն է սև");
	var tale = "Մի անգամ մենք Նոր տարին նշում էինք ";
	tale += home;
	tale += "։ Այդ տարի ես շատ նվերներ էի ուզել ձմեռ պապից, բայց գիտեի, որ դա ձմեռ պապը չի բերում, և որոշեցի թաքնվել ու հետևել։ Ես վերցրի իմ ";
	tale += plate;
	tale += "ը և թաքնվեցի ";
	tale += place;
	tale += "ի տանիքին։ Ես շատ էի սիրում ";
	tale += food;
	tale += " և տանիքին տեսա լիքը ";
	tale += food;
	tale += "։ Ես մոտեցա դրանց ու նրանք սկսեցին ";
	tale += sound;
	tale += " ուժգին։ Ես տանիքից թռա կոյուղի և հանդիպեցի ";
	tale += singer;
	tale += "ին։ Նա ինձ համար երգեց։ Ես շատ ուրախացա, և ես էլ պարեցի։ Կոյուղու ջրերը ծափ էին տալիս։ Երբ ճանապարհորդությունը ավարտվեց, ես գոռացի, որ ինձ տանեն հետ։ Երբ հասանք, ես ասացի, որ ես ուզում եմ դառնալ ";
	tale += work;
	tale += "։ Բոլորը ասացին, որ դա լավ միտք է։ Ես այդ պահին հիշեցի, որ ";
	tale += plate; 
	tale += "ը փակել են ծխնելույզը։ Ես վազեցի ";
	tale += place;
	tale += "ի տանիք ու հանեցի ";
	tale += plate;
	tale += "ը . պարզվեց, որ ձմեռ պապը այնքան էր ուզել նվերները բերել, որ նիհարել էր ու սրընթաց ընկել էր բուխարու մեջ և մոխրից դարձել սև ";
	tale += black;
	tale += ": \n \n Հեղինակ՝ Արեգ Սերոբյան";
	alert(tale);
}
function tale1(){
	var name = prompt("Գրեք ձեր անունը և ազգանունը");
	var home = prompt("Գրեք մի վայր, որտեղ գիրք եք կարդում(...ում)");
	var plate = prompt("Գրեք մի իր, որը միշտ ձեզ հետ է");
	var place = prompt("Գրեք մի վայր, որտեղ շատ եք բարկանում (...ում)");
	var santa = prompt("Գրեք ձեր սիրելի ուսուցչի անունը");
	var elf = prompt("Գրեք այն ազգությունը, որը ամենից շատ եք ատում(...ներ,եր)");
	var food = prompt("Գրեք ձեր սիրած ուտելիքը(հոգնակի թվով, ...ներ,եր)");
	var present = prompt("Ինչ եք երազում ունենալ(եզակի թվով)");
	var bus = prompt("Ինչով եք նախընտրում երկար ճանապարհ անցնել(նավ, մեքենա, ձի, հեծանիվ, մոտոցիկլ)");
	var bird = prompt("Գրեք ձեր սիրած թռչունի անունը");
	var tale = "Ես ինձ համար նստած էի ";
	tale += home;
	tale += " և մեկ էլ երկնքից ընկավ ";
	tale += plate;
	tale += ": Ես շատ երջանիկ էի և վերցրի այն: Կատարվեց ամանորյա հրաշք, և ես հայտնվեցի ";
	tale += place;
	tale += ": Այդտեղ կար ևս մի ";
	tale += plate;
	tale += ", և ես մտածեցի, որ, դրան դիպչելով, կվերադառնամ տուն, բայց հայտնվեցի Լապլանդիայում: Դա սովորական Լապլանդիա չէր. այնտեղ ձմեռ պապիկի փոխարեն ";
	tale += santa;
	tale += " էր, իսկ էլֆերի փոխարեն՝ ";
	tale += elf;
	tale += ":Այդ ";
	tale += elf;
	tale += "ը սկսեցին ինձ քաշքշել ու ինձ դարձրին իրենց նման զվարճասեր: Հետո երկնքից սկսեցին թափվել ";
	tale += food;
	tale += ", իսկ ես իմ բերանը լայն բացեցի ու կուլ տվեցի բոլորը: Երբ մտա ";
	tale += santa;
	tale += "ի աշխատասենյակ, մի պահարան տեսա, որի վերևում մի անցք կար: Նա մտցնում էր նամակը անցքից և բացում դուռը, իսկ դռնից ներս լինում էր այն, ինչ նամակում էր գրված: Հետո նա տալիս էր ինձ այդ նվերները, և ես սկսում էի փաթեթավորել: Հետո նա հանդիպեց մի նամակի, որի վրա գրված էր «";
	tale += name;
	tale += "»: Երբ նա մտցրեց իմ նամակը անցքից, դուռը բացվեց, և իմ ուզած ";
	tale += present;
	tale += "ը ցատկեց իմ ձեռքերի մեջ: Հետո իմ նվերը կերպարանափոխվեց և սկսեց օգնել ինձ փաթեթավորելու նվերները: Մենք փաթեթավորեցինք բոլոր նվերները և լցրինք մի մեծ կարմիր պարկի մեջ, հետո այդ պարկը տարանք թռչող ";
	tale += bus;
	tale += "ի մեջ և թռանք երկինք։ Երբ անցնում էինք մեր տան վերևով, ես ցատկեցի և բարեհաջող ընկա մեր տանիքին։ Այդ պահին մի ";
	tale += bird;
	tale += " եկավ և ինձ բռնեց ու բարձրացրեց երկինք և գցեց թռչող ";
	tale += bus;
	tale += "ի մեջ։ Ես այդ պահին ամբողջությամբ դարձա այդ տարօրինակ ";
	tale += elf;
	tale += "ի նման ու հիմա աշխատում եմ ";
	tale += santa;
	tale += "ի համար։ \n \n Հեղինակ՝ Տիգրան Սերոբյան";
	alert(tale);
}
